app/Http/Controllers/API/AthleteController.php

select * from `athletes` where `grad_year` between 2021 and 2025 order by `last_name` asc, `first_name` asc limit 50 offset 0
select * from `fall_sports` where `fall_sports`.`id` in (1, 2, 3, 4, 5)
select * from `spring_sports` where `spring_sports`.`id` in (1, 2, 3, 4, 5)
select * from `winter_sports` where `winter_sports`.`id` in (1, 2, 3, 4, 5)
---
    public function index()
    {
        return Athlete::whereBetween('grad_year', [2021, 2025])
            ->orderBy('last_name')
            ->orderBy('first_name')
            ->with('fallSport')
            ->with('springSport')
            ->with('winterSport')
            ->paginate(50);

delete from `athletes` where `id` = 105
---
    public function destroy(Athlete $athlete)
    {
        $athlete->delete();