app/Http/Controllers/API/PhysicalController.php

    public function index()
    {
        $ly = Carbon::now()->year - 1;

        return Physical::with(['athlete' => function ($q) {
            $q->orderBy('last_name')->orderBy('first_name');
        }])
            ->whereYear('exam_date', '>=', $ly)
            ->paginate(100);
---
select * from `athletes` where `athletes`.`id` in (8, 14, 23, 24, 25, 62, 80, 103)
select count(*) as aggregate from `physicals` where year(`exam_date`) >= 2019