app/Http/Controllers/API/Sports/FallSportController.php

    public function update(Request $request, FallSport $fallSport)
    {
        request()->validate([
            'name'   => 'required|string'
        ]);

        $fallSport->update(request(['name']));
---
update `fall_sports` set `name` = 'Competition Cheerleading', `slug` = 'competition-cheerleading-fall', `fall_sports`.`updated_at` = '2020-08-08 13:50:27' where `id` = 3