app/Http/Controllers/Sports/FallSportController.php

    public function show(FallSport $fallSport)
    {
        $athletes = Athlete::where('fall_sport_id', $fallSport->id)
            ->orderBy('last_name')->orderBy('first_name')
            ->with('latestPhysical')
            ->get();
---
select * from `athletes` where `fall_sport_id` = 5 order by `last_name` asc, `first_name` asc