app/Http/Controllers/AthleteController.php

    public function index()
    {
        $athletes = Athlete::query()
            ->with('latestPhysical')
            ->with('fallSport')
            ->with('winterSport')
            ->with('springSport')
            ->orderBy('last_name')
            ->orderBy('first_name')
            ->get();
---
select * from `athletes` where `grad_year` between 2021 and 2025 order by `last_name` asc, `first_name` asc
select * from `fall_sports` where `fall_sports`.`id` in (1, 2, 3, 4, 5)
select * from `spring_sports` where `spring_sports`.`id` in (1, 2, 3, 4, 5)
select * from `winter_sports` where `winter_sports`.`id` in (1, 2, 3, 4, 5)