app/Http/Controllers/PhysicalController.php

select * from `athletes` where `athletes`.`id` in (8, 14, 23, 24, 25, 62, 80, 103)
select * from `physicals` where year(`exam_date`) >= 2019 order by `exam_date` desc
---
    public function index()
    {
        $physicals = Physical::with('athlete')
            ->orderBy('exam_date', 'desc')
            ->get();