app/Http/Controllers/SportController.php

    public function index()
    {
        $fallSports = FallSport::orderBy('name')->get();
        $winterSports = WinterSport::orderBy('name')->get();
        $springSports = SpringSport::orderBy('name')->get();
---
select * from `fall_sports` order by `name` asc
select * from `winter_sports` order by `name` asc
select * from `spring_sports` order by `name` asc