app/Models/Physical.php

select * from `athletes` where `athletes`.`id` = 103 limit 1
---
    public function getAthleteNameAttribute()
    {
        return $this->athlete->last_name . ', ' . $this->athlete->first_name;